# -*- coding: utf-8 -*-
"""
Created on Sat Oct  8 14:35:34 2022

@author: ophel
"""
#%%
# 1. 简单的方法
名字 = '老李'
性别 = '男'
年龄 = 60

print('我的名字' + 名字 + '。') 
print('我的名字',名字,'。') 

print('我的名字 ' + 名字 + 年龄 + '岁。') # 只能字符串

print('我的名字 ',名字,年龄,'岁。') 

#%%

# 2. %格式化字符串

名字 = '老李'
性别 = '男'
年龄 = 60
      
print("姓名：%s,性别：%s, 年龄：%d岁。" %(名字,性别,年龄))

#%%
x = 1
y = 3
z = x/y

print('%d除以%d的结果为%f.'%(x,y,z))
print('%d除以%d的结果，保留小数点后一位数为%.1f.'%(x,y,z))
print('%d除以%d的结果，保留小数点后两位数为%.2f.'%(x,y,z))
print('%d除以%d的结果，保留小数点后三位数为%.3f.'%(x,y,z))

#%%

# 3. format()格式化字符串

名字 = '老李'
性别 = '男'
年龄 = 60

print("姓名为{}，性别是{}, 年龄为{}岁。".format(名字,性别,年龄))

#%%
x = 1
y = 3
z = x/y

print('{}除{}的结果为{}。'.format(x,y,z))
print('{}除{}的结果,保留小数点后一位数为为{:.1f}。'.format(x,y,z))
print('{}除{}的结果，保留小数点后两位数为为{:.2f}。'.format(x,y,z))
print('{}除{}的结果，保留小数点后三位数为为{:.3f}。'.format(x,y,z))

#%%

# 4. f-string

名字 = '老李'
性别 = '男'
年龄 = 60

print(f"姓名为{名字}，性别是{性别}, 年龄为{年龄}岁。")

#%%
x = 1
y = 3
z = x/y

print(f'{x}除以{y}的结果为{z}。')
print(f'{x}除以{y}的结果,保留小数点后一位数为为{z:.1f}。')
print(f'{x}除以{y}的结果，保留小数点后两位数为为{z:.2f}。')
print(f'{x}除以{y}的结果，保留小数点后三位数为为{z:.3f}。')
